#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble_zone: Refreshing state... [id=Z06242472H0DG7GFLG30T]
aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=724n8xu7mk]
aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/29037fba-829c-4870-9979-4b1574a8c6fd]
aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_autodiscover_CNAME]
aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z06242472H0DG7GFLG30T__TXT]
aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_email_CNAME]
aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z06242472H0DG7GFLG30T__MX]
aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_legacy_CNAME]
data.aws_secretsmanager_secret.secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
aws_api_gateway_resource.about_page_content: Refreshing state... [id=syryal]
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d393xlsrttjy5b]
aws_api_gateway_method.about_page_content_method: Refreshing state... [id=agm-724n8xu7mk-syryal-GET]
aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_api_gateway_method_response.about_page_content_method_response: Refreshing state... [id=agmr-724n8xu7mk-syryal-GET-200]
aws_api_gateway_integration.about_page_content_integration: Refreshing state... [id=agi-724n8xu7mk-syryal-GET]
aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_deployment.api_deployment: Refreshing state... [id=2my7jd]
aws_amplify_branch.main: Refreshing state... [id=d393xlsrttjy5b/main]
aws_amplify_branch.dev: Refreshing state... [id=d393xlsrttjy5b/dev]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d393xlsrttjy5b/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api_deployment must be replaced
-/+ resource "aws_api_gateway_deployment" "api_deployment" {
      ~ created_date  = "2024-05-15T10:37:14Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-1:287212251408:jdub5r46se/" -> (known after apply)
      ~ id            = "2my7jd" -> (known after apply)
      ~ invoke_url    = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)
      ~ rest_api_id   = "jdub5r46se" -> "724n8xu7mk" # forces replacement
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "21970fd3dc343b7d80dc1fce8c3fe02cd0746c33" -> "3e1f73807c967f25c7a035c7908b10ca9e0b57c9"
        }
    }

  # aws_api_gateway_integration_response.about_page_content_integration_response will be created
  + resource "aws_api_gateway_integration_response" "about_page_content_integration_response" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "syryal"
      + response_templates = {
          + "application/json" = <<-EOT
                {
                          "title": "About Me",
                          "date": "2024-05-14T15:23:56Z",
                          "bodyClass": "page-about",
                          "sections": [
                              {
                                  "type": "text",
                                  "content": "My name is **Thomas Oliver Kimble**, an engineer with a rich blend of skills and interests, encompassing data science, robotics, cloud engineering, and a strong passion for both music and design."
                              },
                              {
                                  "type": "image",
                                  "src": "/images/about/me.jpg"
                              },
                              {
                                  "type": "header",
                                  "content": "Personal Life"
                              },
                              {
                                  "type": "text",
                                  "content": "Originally from England, I moved to Switzerland when I was three and later to France. My education was mainly in Switzerland, where I pursued engineering—a field that aligned perfectly with my passion for math, science, and design. This combination of interests led me to explore both the analytical and creative sides of my personality, particularly through music. From the age of seven, I was immersed in music, playing in bands and learning instruments like the guitar, drums, and piano."
                              }
                          ]
                      }
            EOT
        }
      + rest_api_id        = "724n8xu7mk"
      + status_code        = "200"
    }

  # aws_api_gateway_stage.prod will be created
  + resource "aws_api_gateway_stage" "prod" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "724n8xu7mk"
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ api_deployment_arn = "arn:aws:execute-api:eu-west-1:287212251408:jdub5r46se/" -> (known after apply)
  ~ api_endpoint       = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/prod/GetAbout" -> (known after apply)
  ~ api_gateway_url    = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*